Import python libraries.

In [70]:
import pandas as pd
import numpy as np

Read and preview the data.

In [71]:
data = pd.read_csv('kiva_loans.csv')
data.head()

,id,funded_amount,loan_amount,activity,sector,use,country_code,country,region,currency,partner_id,posted_time,disbursed_time,funded_time,term_in_months,lender_count,tags,borrower_genders,repayment_interval,date
0,653051,300.0,300.0,Fruits & Vegetables,Food,"To buy seasonal, fresh fruits to sell.",PK,Pakistan,Lahore,PKR,247.0,2014-01-01 06:12:39+00:00,2013-12-17 08:00:00+00:00,2014-01-02 10:06:32+00:00,12.0,12,NaN,female,irregular,2014-01-01
1,653053,575.0,575.0,Rickshaw,Transportation,to repair and maintain the auto rickshaw used ...,PK,Pakistan,Lahore,PKR,247.0,2014-01-01 06:51:08+00:00,2013-12-17 08:00:00+00:00,2014-01-02 09:17:23+00:00,11.0,14,NaN,"female, female",irregular,2014-01-01
2,653068,150.0,150.0,Transportation,Transportation,To repair their old cycle-van and buy another ...,IN,India,Maynaguri,INR,334.0,2014-01-01 09:58:07+00:00,2013-12-17 08:00:00+00:00,2014-01-01 16:01:36+00:00,43.0,6,"user_favorite, user_favorite",female,bullet,2014-01-01
3,653063,200.0,200.0,Embroidery,Arts,to purchase an embroidery machine and a variet...,PK,Pakistan,Lahore,PKR,247.0,2014-01-01 08:03:11+00:00,2013-12-24 08:00:00+00:00,2014-01-01 13:00:00+00:00,11.0,8,NaN,female,irregular,2014-01-01
4,653084,400.0,400.0,Milk Sales,Food,to purchase one buffalo.,PK,Pakistan,Abdul Hakeem,PKR,245.0,2014-01-01 11:53:19+00:00,2013-12-17 08:00:00+00:00,2014-01-01 19:18:51+00:00,14.0,16,NaN,female,monthly,2014-01-01

Look at data columns, null values and data types.

In [72]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 671205 entries, 0 to 671204
Data columns (total 20 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  671205 non-null  int64
 1   funded_amount       671205 non-null  float64
 2   loan_amount         671205 non-null  float64
 3   activity            671205 non-null  object
 4   sector              671205 non-null  object
 5   use                 666973 non-null  object
 6   country_code        671197 non-null  object
 7   country             671205 non-null  object
 8   region              614405 non-null  object
 9   currency            671205 non-null  object
 10  partner_id          657698 non-null  float64
 11  posted_time         671205 non-null  object
 12  disbursed_time      668809 non-null  object
 13  funded_time         622874 non-null  object
 14  term_in_months      671205 non-null  float64
 15  lender_count        671205 non-null  int64
 16  tags                499789 non-null  object
 17  borrower_genders    666984 non-null  object
 18  repayment_interval  671205 non-null  object
 19  date                671205 non-null  object
dtypes: float64(4), int64(2), object(14)
memory usage: 102.4+ MB

I will drop the following columns because they do not contain any information that will help in the analysis of Kiva borrowers.

In [73]:
#drop the following columns because they do not have a direct relationship with the borrowers of Kiva.
data.drop(['funded_amount', 'activity', 'use', 'country_code', 'region', 'currency', 'partner_id', 'posted_time', 'disbursed_time', 'funded_time', 'lender_count', 'tags'], axis=1, inplace=True)

In [74]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 671205 entries, 0 to 671204
Data columns (total 8 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  671205 non-null  int64
 1   loan_amount         671205 non-null  float64
 2   sector              671205 non-null  object
 3   country             671205 non-null  object
 4   term_in_months      671205 non-null  float64
 5   borrower_genders    666984 non-null  object
 6   repayment_interval  671205 non-null  object
 7   date                671205 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 41.0+ MB

In [75]:
data.sample(10)

,id,loan_amount,sector,country,term_in_months,borrower_genders,repayment_interval,date
58043,710645,575.0,Food,Kenya,14.0,female,irregular,2014-05-15
270147,917473,750.0,Housing,Cambodia,14.0,female,monthly,2015-07-15
76328,728312,2500.0,Retail,Zimbabwe,11.0,"female, female, female, female, female",monthly,2014-06-20
58838,710902,100.0,Food,Philippines,8.0,female,irregular,2014-05-16
434421,1094205,200.0,Personal Use,Cambodia,8.0,"female, female, female, female, female",monthly,2016-06-03
215824,863960,1150.0,Food,Sierra Leone,8.0,male,monthly,2015-03-30
233414,881264,125.0,Personal Use,Lao People's Democratic Republic,9.0,"male, male",bullet,2015-05-07
374077,1020907,2000.0,Education,Kenya,25.0,male,monthly,2016-02-10
45989,698212,225.0,Housing,Philippines,60.0,female,irregular,2014-04-16
544964,1205935,175.0,Personal Use,Cambodia,8.0,"male, male, male, male",monthly,2016-12-19

I'll change the date column to a datetime data type for easy time analysis.

In [76]:
data['date'] = pd.to_datetime(data['date'], format='%Y-%m-%d')

I'll use isnull() method and chain it with sum() to find the total number of nulls in each column in the DataFrame

In [77]:
data.isnull().sum()

id                       0
loan_amount              0
sector                   0
country                  0
term_in_months           0
borrower_genders      4221
repayment_interval       0
date                     0
dtype: int64

In [78]:
data.shape

(671205, 8)

I have noticed some anomalies in the gender column that could have occurred during data collection, so I'll clean it up.

In [79]:
data['borrower_genders'].sample(10)

66245                   female
64492                   female
150527                  female
381259    female, female, male
609778            male, female
360755                  female
67008                   female
486648                  female
242162                  female
382780                  female
Name: borrower_genders, dtype: object

I'll create a new column, of boolean type, to contain strings that contains female. True contains female, and False will hence contain male.

In [80]:
data['female_gender'] = data['borrower_genders'].str.contains('female')

I'll create a gender column that encodes the above classification into 'F' and 'M'.

In [81]:
data.loc[data['female_gender'] == True, 'gender'] = 'F'
data.loc[data['female_gender'] == False, 'gender'] ='M'

I will drop the following columns since I now have a clean gender column. Using the drop() method, with axis and inplace arguments.

In [82]:
data.drop(['borrower_genders', 'female_gender'], axis=1, inplace=True)

Now let's look at unique values and their counts in the gender column, using value_counts() method.

In [83]:
print(data['gender'].value_counts())

F    528461
M    138523
Name: gender, dtype: int64

I'll fill in the rows with missing values, with the gender that has the least counts, since 4221 is a significant number to do away with in my DataFrame.

I will use the fillna() method, with value, axis and inplace as keyword arguments.

In [84]:
#fill any gender row with a missing value
data.fillna(value='M', axis=1, inplace=True)
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 671205 entries, 0 to 671204
Data columns (total 8 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  671205 non-null  int64
 1   loan_amount         671205 non-null  float64
 2   sector              671205 non-null  object
 3   country             671205 non-null  object
 4   term_in_months      671205 non-null  float64
 5   repayment_interval  671205 non-null  object
 6   date                671205 non-null  datetime64[ns]
 7   gender              671205 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 41.0+ MB

I will convert the gender column into a category.

In [85]:
category = ['F', 'M']
cat_dtype = pd.api.types.CategoricalDtype(categories=category, ordered=True)
data['gender'] = data['gender'].astype(cat_dtype)

print(data.gender.sample(5))

101611    F
515709    F
435874    F
213948    F
541139    F
Name: gender, dtype: category
Categories (2, object): [F < M]

Let's look at the repayment_interval column.
Use value_counts() to find counts of unique values in the column.

In [86]:
print(data['repayment_interval'].value_counts())

monthly      342717
irregular    257158
bullet        70728
weekly          602
Name: repayment_interval, dtype: int64

bullet could mean daily, so I'll change it.

In [87]:
data.loc[data['repayment_interval'] == 'bullet', 'repayment_interval'] = 'daily'

I'll change the repayment_interval column to a category too. Directly, using astype() method, with category as an argument.

In [88]:
data['repayment_interval'] = data['repayment_interval'].astype('category')
print(data['repayment_interval'].dtype)
print(data.repayment_interval.value_counts())

category
monthly      342717
irregular    257158
daily         70728
weekly          602
Name: repayment_interval, dtype: int64

Let's look at the country column

In [89]:
data.country.head()

0    Pakistan
1    Pakistan
2       India
3    Pakistan
4    Pakistan
Name: country, dtype: object

In [90]:
print(data.country.unique())
print(data.country.nunique())

['Pakistan' 'India' 'Kenya' 'Nicaragua' 'El Salvador' 'Tanzania'
 'Philippines' 'Peru' 'Senegal' 'Cambodia' 'Liberia' 'Vietnam' 'Iraq'
 'Honduras' 'Palestine' 'Mongolia' 'United States' 'Mali' 'Colombia'
 'Tajikistan' 'Guatemala' 'Ecuador' 'Bolivia' 'Yemen' 'Ghana'
 'Sierra Leone' 'Haiti' 'Chile' 'Jordan' 'Uganda' 'Burundi' 'Burkina Faso'
 'Timor-Leste' 'Indonesia' 'Georgia' 'Ukraine' 'Kosovo' 'Albania'
 'The Democratic Republic of the Congo' 'Costa Rica' 'Somalia' 'Zimbabwe'
 'Cameroon' 'Turkey' 'Azerbaijan' 'Dominican Republic' 'Brazil' 'Mexico'
 'Kyrgyzstan' 'Armenia' 'Paraguay' 'Lebanon' 'Samoa' 'Israel' 'Rwanda'
 'Zambia' 'Nepal' 'Congo' 'Mozambique' 'South Africa' 'Togo' 'Benin'
 'Belize' 'Suriname' 'Thailand' 'Nigeria' 'Mauritania' 'Vanuatu' 'Panama'
 'Virgin Islands' 'Saint Vincent and the Grenadines'
 "Lao People's Democratic Republic" 'Malawi' 'Myanmar (Burma)' 'Moldova'
 'South Sudan' 'Solomon Islands' 'China' 'Egypt' 'Guam' 'Afghanistan'
 'Madagascar' 'Namibia' 'Puerto Rico' 'Lesotho' "Cote D'Ivoire" 'Bhutan']
87

Let's also look at the sector column

In [91]:
print(data.sector.unique())
print(data.sector.nunique())
data.sector.value_counts()

['Food' 'Transportation' 'Arts' 'Services' 'Agriculture' 'Manufacturing'
 'Wholesale' 'Retail' 'Clothing' 'Construction' 'Health' 'Education'
 'Personal Use' 'Housing' 'Entertainment']
15

Agriculture       180302
Food              136657
Retail            124494
Services           45140
Personal Use       36385
Housing            33731
Clothing           32742
Education          31013
Transportation     15518
Arts               12060
Health              9223
Construction        6268
Manufacturing       6208
Entertainment        830
Wholesale            634
Name: sector, dtype: int64

Because Food and Agriculture are directly related, I have changed them to one: Agriculture

In [92]:
data.loc[data['sector'] == 'Food', 'sector'] = 'Agriculture'
data.sector.unique()

array(['Agriculture', 'Transportation', 'Arts', 'Services',
       'Manufacturing', 'Wholesale', 'Retail', 'Clothing', 'Construction',
       'Health', 'Education', 'Personal Use', 'Housing', 'Entertainment'],
      dtype=object)

Check for duplicates in the whole DataFrame using the duplicated() method.

In [93]:
data.duplicated().sum()

0

### Testing hypothesis towards finding out about the borrowers in Kiva.


1.Who are they?-Gender.
2.What do they do?-Sector
3.Where do they come from?-Country
4.How long have they borrowed?-term in months
5.How do they pay? Poverty levels? -repayment intervals
6.Which country borrows the most or the least? & In which sector?

#### 1.What is the gender of most borrowers in Kiva?

###### My hypothesis is that most borrowers in Kiva are female.

I will create variables with counts of each gender and use the total to calculate the percentage of each gender.

In [94]:
female_borrowers = data.gender[data['gender'] == 'F'].count()
male_borrowers = data.gender[data['gender'] == 'M'].count()
total_borrowers = data.shape[0]
print('The female borrowers are: {:.0%}'.format(female_borrowers /total_borrowers))
print('The male borrowers are: {:.0%}'.format(male_borrowers /total_borrowers))

The female borrowers are: 79%
The male borrowers are: 21%

##### Female borrowers, at 79% are more than male borrowers at 21%.

#### 2.In which sector are the female and male genders involved in respectively?

###### My hypothesis is that most female are in the Agriculture sector, and male in the Transportation sector.

In [95]:
female_data = data[data['gender'] == 'F']
male_data = data[data['gender'] == 'M']
female_data.head(5)
#male_data.sample(10)

,id,loan_amount,sector,country,term_in_months,repayment_interval,date,gender
0,653051,300.0,Agriculture,Pakistan,12.0,irregular,2014-01-01,F
1,653053,575.0,Transportation,Pakistan,11.0,irregular,2014-01-01,F
2,653068,150.0,Transportation,India,43.0,daily,2014-01-01,F
3,653063,200.0,Arts,Pakistan,11.0,irregular,2014-01-01,F
4,653084,400.0,Agriculture,Pakistan,14.0,monthly,2014-01-01,F

In [96]:
female_data['sector'].value_counts()

Agriculture       250078
Retail            109244
Services           34512
Clothing           29752
Personal Use       27580
Housing            25177
Education          19008
Arts               10758
Transportation      8521
Health              6203
Manufacturing       3799
Construction        3047
Entertainment        424
Wholesale            358
Name: sector, dtype: int64

Most female borrowers are in the Agriculture sector.

In [97]:
print('The sector with the most amount of loan borrowed:', data.groupby('sector')['loan_amount'].sum().idxmax())
print('The highest loan amount borrowed per sector:{:.0f}'.format(data.groupby('sector')['loan_amount'].sum().max()))

The sector with the most amount of loan borrowed: Agriculture
The highest loan amount borrowed per sector:264674025

In [98]:
male_data['sector'].value_counts()

Agriculture       66881
Retail            15250
Education         12005
Services          10628
Personal Use       8805
Housing            8554
Transportation     6997
Construction       3221
Health             3020
Clothing           2990
Manufacturing      2409
Arts               1302
Entertainment       406
Wholesale           276
Name: sector, dtype: int64

Most male borrowers are also in the Agriculture sector.

##### Both male and female borrowers are in the agricultural sector.

#### 3. In which country do most borrowers come from?

I will use the groupby() method to group my data by country,  and the agg() method to find the value counts in the female column.

In [99]:
country_grouped = data.groupby('country').agg({'gender': ['value_counts']})
country_grouped.head(5)

                         gender
                   value_counts
country     gender
Afghanistan F                 2
Albania     F              1018
            M               916
Armenia     F              5383
            M              3248

In [100]:
type(country_grouped)

pandas.core.frame.DataFrame

In [101]:
print(country_grouped['gender'].idxmin(), country_grouped['gender'].min())

value_counts    (Bhutan, F)
dtype: object value_counts    1
dtype: int64

In [102]:
print(country_grouped['gender'].idxmax(), country_grouped['gender'].max())

value_counts    (Philippines, F)
dtype: object value_counts    151984
dtype: int64

##### The highest country borrrower is Phillipines. In Phillippines, the female gender borrows the most.
##### The lowest country borrower is Bhutan. With one female borrower.

Why Phillipines? Is Kiva a Phillipines' company? Have more financial campaigns been done in Phillipines?

#### 4. How long have they borrowed?
Which is the longest borrowing gender?
Which is the longest borrowing country?

In [103]:
data.term_in_months.sample(5)
data.term_in_months.describe()

count    671205.000000
mean         13.739022
std           8.598919
min           1.000000
25%           8.000000
50%          13.000000
75%          14.000000
max         158.000000
Name: term_in_months, dtype: float64

The mean and the median are the same, so there are no outliers affecting the mean.

Although the standard deviation is too high, this means that some values are too far from the mean.

I'll group by gender to find the maximum term in months for each gender.

In [104]:
term_gender = data.groupby('gender')['term_in_months'].max()
print(term_gender)

gender
F    158.0
M    154.0
Name: term_in_months, dtype: float64

Grouping by country and then sorting in descending order to find which country has the longest borrower.

In [105]:
term_country = data.groupby('country')['term_in_months'].max()
print(term_country.sort_values(ascending=False))

country
Dominican Republic    158.0
Mexico                144.0
South Africa          141.0
Kenya                 122.0
Cambodia              120.0
                      ...
Lesotho                12.0
Cote D'Ivoire          10.0
Congo                   8.0
Afghanistan             8.0
Namibia                 7.0
Name: term_in_months, Length: 87, dtype: float64

I will access the row with full details of the borrower with the longest and shortest term, using the .loc() access method

In [106]:
(data.loc[data['term_in_months'] == 158])

,id,loan_amount,sector,country,term_in_months,repayment_interval,date,gender
215863,863993,6725.0,Education,Dominican Republic,158.0,irregular,2015-03-30,F

In [107]:
data.loc[data['term_in_months']== 1]

,id,loan_amount,sector,country,term_in_months,repayment_interval,date,gender
1877,1080189,125.0,Services,Kenya,1.0,irregular,2014-01-08,M
2915,1080219,250.0,Clothing,Kenya,1.0,irregular,2014-01-10,F
4277,1080268,125.0,Agriculture,Kenya,1.0,irregular,2014-01-15,M
6772,1080311,125.0,Clothing,Kenya,1.0,irregular,2014-01-21,F
7851,1080328,125.0,Services,Kenya,1.0,weekly,2014-01-23,M
10478,1080374,125.0,Clothing,Kenya,1.0,irregular,2014-01-29,F
11319,1080391,250.0,Transportation,Kenya,1.0,irregular,2014-01-31,F
11410,1080393,250.0,Retail,Kenya,1.0,irregular,2014-01-31,F
11488,1080392,250.0,Agriculture,Kenya,1.0,irregular,2014-01-31,F
11599,1080394,250.0,Agriculture,Kenya,1.0,irregular,2014-01-31,F
11617,1080388,250.0,Services,Kenya,1.0,irregular,2014-01-31,M
11800,1080405,250.0,Services,Kenya,1.0,irregular,2014-02-02,F
11803,1080404,250.0,Retail,Kenya,1.0,irregular,2014-02-02,F
12178,1080420,250.0,Retail,Kenya,1.0,irregular,2014-02-03,F
12453,1080434,250.0,Clothing,Kenya,1.0,irregular,2014-02-04,F
14310,1080473,125.0,Retail,Kenya,1.0,irregular,2014-02-09,F
15542,1080489,125.0,Clothing,Kenya,1.0,irregular,2014-02-11,F
29016,1080675,250.0,Retail,Kenya,1.0,irregular,2014-03-11,F
29789,1080683,250.0,Clothing,Kenya,1.0,irregular,2014-03-12,F
39694,1080894,250.0,Construction,Kenya,1.0,irregular,2014-04-02,F
45830,1081076,125.0,Clothing,Kenya,1.0,irregular,2014-04-16,F
45986,1081078,125.0,Retail,Kenya,1.0,irregular,2014-04-16,F
48474,1081137,250.0,Agriculture,Kenya,1.0,irregular,2014-04-23,M
49396,1081156,250.0,Clothing,Kenya,1.0,irregular,2014-04-24,F
53098,1081263,125.0,Agriculture,Kenya,1.0,weekly,2014-05-03,F
81739,1082038,250.0,Transportation,Kenya,1.0,irregular,2014-07-02,F
82547,1082049,250.0,Agriculture,Kenya,1.0,irregular,2014-07-03,F
121850,1083671,100.0,Agriculture,Kenya,1.0,irregular,2014-09-22,F
196159,1087579,75.0,Agriculture,Kenya,1.0,irregular,2015-02-20,F
199098,1087727,75.0,Agriculture,Kenya,1.0,irregular,2015-02-26,F
208871,1088074,75.0,Agriculture,Kenya,1.0,irregular,2015-03-17,F

###### I have discovered that the Dominican Republic hosts the longest borrower, while Kenya hosts the shortest borrowers!

###### This could be most likely that Kiva started its operations earlier in Dominican Republic than in Kenya.

Or that the borrower with the longest term is an outlier. Let's find out.

I'll slice my data set to find out how many customers have been borrowers for more than 5 years i.e 60 months.

In [108]:
long = data[data['term_in_months'] >60]
print(long['term_in_months'].count())

3382

Well, only 3000 out of 660000 customers have borrowed for more than 5 years. Seems insignificant enough that i might do away with them...

I'll visulaize first to see how they affect histograms and other distribution curves.

#### 5. At what intervals do they pay?
    How do they pay? Poverty levels? -repayment intervals

In [109]:
data['repayment_interval'].value_counts()

monthly      342717
irregular    257158
daily         70728
weekly          602
Name: repayment_interval, dtype: int64

In [110]:
print(data['repayment_interval'].value_counts().idxmax(), data['repayment_interval'].value_counts().max())

monthly 342717

Monthly repayments are the highest, closely followed by irregular payments.

Create a pivot table to find the count of repayment intervals by grouping by sector, using the loan amount values.

In [111]:
repayment_sector = data.pivot_table(index='sector', values='loan_amount',columns='repayment_interval', aggfunc=['count'])

repayment_sector.columns = ['daily', 'irregular', 'monthly', 'weekly']
repayment_sector.fillna(value=0, inplace=True)
repayment_sector.sort_values(by='monthly', ascending=False)

                  daily  irregular   monthly  weekly
sector
Agriculture     48570.0   123438.0  144815.0   136.0
Retail           4940.0    73646.0   45784.0   124.0
Personal Use     4791.0     4083.0   27511.0     0.0
Services         5083.0    12552.0   27352.0   153.0
Housing           880.0     8451.0   24400.0     0.0
Education        2437.0     4351.0   24225.0     0.0
Clothing         1048.0    13559.0   17997.0   138.0
Transportation    410.0     6405.0    8691.0    12.0
Health            138.0     1659.0    7413.0    13.0
Arts             1475.0     4636.0    5934.0    15.0
Construction      294.0     1549.0    4414.0    11.0
Manufacturing     451.0     2439.0    3318.0     0.0
Entertainment     155.0      226.0     449.0     0.0
Wholesale          56.0      164.0     414.0     0.0

Since most repayment intervals in general are done monthly, I have decided to sort the values by the monthly column.
I can deduce that Agriculture, Retail and Personal Use are the top three sectors in the monthly repayment interval.
This could mean that these sectors have a return period of a month.

In [112]:
data.groupby('country')['repayment_interval'].value_counts().idxmax()

('Philippines', 'irregular')

In [113]:
repayment_country = data.pivot_table(index='country', values='loan_amount',columns='repayment_interval', aggfunc=['count'])
repayment_country[repayment_country.index == 'Philippines']
repayment_country.columns = ['daily', 'irregular', 'monthly', 'weekly']
repayment_country.fillna(value=0, inplace=True)
repayment_country.head()

             daily  irregular  monthly  weekly
country
Afghanistan    2.0        0.0      0.0     0.0
Albania       23.0       26.0   1885.0     0.0
Armenia       43.0      170.0   8418.0     0.0
Azerbaijan     0.0       12.0   1933.0     0.0
Belize         0.0        0.0    125.0     0.0

Let's look at each sorted repayment_interval category, and identify countries that are in the top5.

In [114]:
print(repayment_country['daily'].sort_values(ascending=False).head())

country
Colombia       13785.0
Nigeria        10135.0
Kenya           9567.0
El Salvador     8185.0
India           6575.0
Name: daily, dtype: float64

In [115]:
repayment_country['weekly'].sort_values(ascending=False).head()

country
Kenya       602.0
Zimbabwe      0.0
Iraq          0.0
Georgia       0.0
Ghana         0.0
Name: weekly, dtype: float64

In [116]:
repayment_country['monthly'].sort_values(ascending=False).head()

country
Kenya          46230.0
Cambodia       34406.0
El Salvador    29764.0
Pakistan       20556.0
Tajikistan     19417.0
Name: monthly, dtype: float64

In [117]:
repayment_country['irregular'].sort_values(ascending=False).head()

country
Philippines    144954.0
Kenya           19426.0
Peru             7455.0
Samoa            7388.0
Uganda           7260.0
Name: irregular, dtype: float64

###### Philippines has the highest counts of repayments in general, and it is also leading in irregular repayments by a very big margin.

###### Kenya has the highest weekly and monthly repayments.

###### Colombia has the highest daily repayments.

##### Kenya appears top3 in every repayment interval category. This means that irrespective of time, most Kenyans repay their loans.

In [118]:
repayment_gender = data.pivot_table(index='repayment_interval', values='loan_amount', columns='gender', aggfunc='count')
repayment_gender.sort_values(by='F', ascending=False)

gender                   F      M
repayment_interval
monthly             250967  91750
irregular           237896  19262
daily                39027  31701
weekly                 571     31

Female customers have the highest repaymnet intervals in all categories, compared to male customers.

Monthly repayment intervals are highly done by both male and female.
This could mean that most sector activities customers are involved in are able to provide a returns on a monthly basis.

A temporary conclusion(some questions still unanswered):
Most Kiva borrowers are female.
Most borrowers(male and female) come from the Phillipines.
Phillipines is also the country with the highest total loan amount borrowed.
Phillipines is also the country that repaid the most loans, irregularly.
I think it's safe to say that Phillipines is an outlier.
The agriculture sector contibutes highly to most loans borrowed and repaid.
Most loan repaymnet intervals are monthly, followed closely by irregularly.
Therefore, poverty levels of Kiva borrowers are low since most people borrow loans to sustain the most basic and largest economic activity- Agriculture.

##### 6. In which date, month and year were most/least loans taken?

The date column represents the date each borrower took their respective loan amount.

In [126]:
data['day'] = data['date'].dt.day
data['month'] = data['date'].dt.month
data['year'] = data['date'].dt.year

In [129]:
data[['date', 'day', 'month', 'year']].sample(10)

             date  day  month  year
257058 2015-06-19   19      6  2015
592268 2017-03-09    9      3  2017
516550 2016-10-28   28     10  2016
276872 2015-07-27   27      7  2015
184276 2015-01-26   26      1  2015
579508 2017-02-17   17      2  2017
557554 2017-01-10   10      1  2017
487359 2016-09-08    8      9  2016
428099 2016-05-24   24      5  2016
370848 2016-02-03    3      2  2016

In [133]:
data['year'].value_counts()

2016    197236
2015    181833
2014    174234
2017    117902
Name: year, dtype: int64

In [135]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 671205 entries, 0 to 671204
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  671205 non-null  int64
 1   loan_amount         671205 non-null  float64
 2   sector              671205 non-null  object
 3   country             671205 non-null  object
 4   term_in_months      671205 non-null  float64
 5   repayment_interval  671205 non-null  category
 6   date                671205 non-null  datetime64[ns]
 7   gender              671205 non-null  category
 8   day                 671205 non-null  int64
 9   month               671205 non-null  int64
 10  year                671205 non-null  int64
dtypes: category(2), datetime64[ns](1), float64(2), int64(4), object(2)
memory usage: 47.4+ MB

In [155]:
#loans by month, by gender
month_loans = data.pivot_table(index='month', values='loan_amount',columns='gender', aggfunc=['sum'])
month_loans.columns = ['F_sum', 'M_sum']
month_loans_sorted = month_loans.sort_values(by='F_sum', ascending=False) 
# most loans by gender
print(month_loans_sorted.head(3))
#least loans by gender
print(month_loans_sorted.tail(3))

            F_sum       M_sum
month
3      44287500.0  13801525.0
5      42201750.0  12781625.0
6      41695525.0  12470925.0
            F_sum      M_sum
month
10     31285300.0  9708900.0
9      30621375.0  9708725.0
8      29768300.0  9208775.0

We can see high amount of loans being taken in the second quarter of the year, and least loans in the third quarter of the year.

In [158]:
#loans by year,by gender
year_loans = data.pivot_table(index='year', values='loan_amount', columns='gender', aggfunc=['sum'])
year_loans.columns = ['F_sum', 'M_sum']
year_loans_sorted = year_loans.sort_values(by='F_sum', ascending=False)
print(year_loans_sorted)
print()
print(year_loans_sorted.head(1))
print()
print(year_loans_sorted.tail(1))

            F_sum       M_sum
year
2016  127184725.0  37250025.0
2015  119552325.0  38070600.0
2014  114390700.0  38533850.0
2017   72416400.0  18022525.0

            F_sum       M_sum
year
2016  127184725.0  37250025.0

           F_sum       M_sum
year
2017  72416400.0  18022525.0

For both male and female borrowers; 2016 was a good year for Kiva, since it has the most borrowed loans, whereas loans decreased sharply in 2017.

### Kenya's analysis.

*I have developed an interest in Kenya, since it popped up as the country with the least term in months.*

I will look at which sector, loan amount and gender in Kenya.

I will slice data from the main dataset that only belongs to Kenya, using the query() method.

In [159]:
kenya_data = data.query('country == "Kenya"')

In [162]:
kenya_data.info()
kenya_data['country'].unique() #check country is only Kenya

<class 'pandas.core.frame.DataFrame'>
Int64Index: 75825 entries, 5 to 671204
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  75825 non-null  int64
 1   loan_amount         75825 non-null  float64
 2   sector              75825 non-null  object
 3   country             75825 non-null  object
 4   term_in_months      75825 non-null  float64
 5   repayment_interval  75825 non-null  category
 6   date                75825 non-null  datetime64[ns]
 7   gender              75825 non-null  category
 8   day                 75825 non-null  int64
 9   month               75825 non-null  int64
 10  year                75825 non-null  int64
dtypes: category(2), datetime64[ns](1), float64(2), int64(4), object(2)
memory usage: 5.9+ MB

1

In [163]:
kenya_data.sector.value_counts()

Agriculture       47716
Retail            10185
Services           5460
Clothing           4753
Personal Use       2130
Transportation     1843
Education          1329
Construction        797
Health              631
Arts                347
Manufacturing       295
Housing             286
Entertainment        32
Wholesale            21
Name: sector, dtype: int64

In [164]:
kenya_data.loan_amount.sum()

34534300.0

In [165]:
kenya_data.gender.value_counts()

F    60093
M    15732
Name: gender, dtype: int64

In [166]:
kenya_data.year.value_counts()

2015    21923
2016    20604
2014    20196
2017    13102
Name: year, dtype: int64

#### A brief conclusion of Kenya. 
In Kenya, just like all other countries, Agriculture sector is leading with most loans taken.

Female borrowers are also more than male borrowers.

There was a sharp decrease in loans taken in 2017.